## Pandas İleri Operasyonlar

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
maasSozluk = {"İsim": ["Sercan","Yiğit","Darya","Şevki"], "Departman": ["Yazılım","Finans", "Yazılım","Pazarlama"], 
              "Maas": [200, 140, 600,340]}

In [4]:
maasDatFrame = pd.DataFrame(data= maasSozluk)

In [5]:
maasDatFrame

     İsim  Departman  Maas
0  Sercan    Yazılım   200
1   Yiğit     Finans   140
2   Darya    Yazılım   600
3   Şevki  Pazarlama   340

In [8]:
maasDatFrame["Departman"].unique()

## Departman içerisindeki unique değerleri getirir

array(['Yazılım', 'Finans', 'Pazarlama'], dtype=object)

In [10]:
maasDatFrame["Departman"].nunique()

## Departman kolonu içindeki unique değerlerin sayısını verir

3

In [12]:
maasDatFrame["Departman"].value_counts()

## Departman kolonu içindeki verilerin değerlerini verir, yani kaç tane o veriden olduğunu

Yazılım      2
Finans       1
Pazarlama    1
Name: Departman, dtype: int64

## Fonksiyon içinde serileri kullanmak

In [13]:
def bruttenNete(maas):
    return maas*0.66

In [15]:
maasDatFrame["Maas"].apply(bruttenNete)

## Bir fonksiyonu bu şekilde seri(dataframe) ie kullanmak mümkündür

0    132.0
1     92.4
2    396.0
3    224.4
Name: Maas, dtype: float64

## devam

In [18]:
maasDatFrame.isnull()

# Null bir değer var mı yok mu onu görürüz

    İsim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

## Pivot Table- Excel gibi

In [20]:
yeniDic = {"Karakter Sınıfı" : ["South","Simpson","South","Family Guy"],
            "Karakter İsmi": ["Ken", "Homer","Cartman","Stewie"],
            "Karakter Yaşı": [9, 40,19, 3]}

In [21]:
yeniFrame = pd.DataFrame(data = yeniDic)

In [22]:
yeniFrame

  Karakter Sınıfı Karakter İsmi  Karakter Yaşı
0           South           Ken              9
1         Simpson         Homer             40
2           South       Cartman             19
3      Family Guy        Stewie              3

In [23]:
yeniFrame.pivot_table(values = "Karakter Yaşı", index =[ "Karakter Sınıfı", "Karakter İsmi"])

                               Karakter Yaşı
Karakter Sınıfı Karakter İsmi
Family Guy      Stewie                     3
Simpson         Homer                     40
South           Cartman                   19
                Ken                        9